<template>
  <div class="vip_agre">
    <h3 class="vip_title"><strong>购买服务协议</strong></h3>
    <div class="sec_title"><strong>一、协议条款的确认和接受</strong></div>
    <p>1.1 本协议是作文说会员服务用户与作文说之间关于用户成为作文说用户并使用作文说提供的会员服务所订立的协议。本协议描述了作文说与会员服务用户之间关于软件许可及服务使用的权利义务关系。“作文说会员服务用户”指享受作文说提供的会员服务的个人或实体。本服务协议是使用作文说会员服务的先决条件。用户若不接受本协议条款，则无权使用相关服务。用户使用服务即表示同意受本协议条款的约束。</p>
    <p>1.2 用户应审阅并接受本协议。未成年人应在法定监护人陪同下审阅并履行本协议。未成年人行使本协议项下权利和义务，需获得法定监护人的认可。用户在使用作文说会员服务时，必须严格遵守本服务协议的条款。</p>
    <div class="sec_title"><strong>二、作文说会员服务说明</strong></div>
    <p>2.1 作文说会员服务涉及的产品所有权及相关软件知识产权均归作文说所有。服务将严格按照服务条款和操作规则执行。用户在使用作文说任何单项服务时，应受本协议约束。</p>
    <p>2.2 作文说保留对会员服务用户网上活动进行监督、提示、检查的权利。若用户行为违反法律法规或本协议条款，作文说有权要求其纠正并追究责任。</p>
    <p>2.3 作文说提供的服务仅限于平台内使用。任何非法分离服务内容与作文说平台的行为，不属于本协议约定的服务。由此引起的法律后果由行为人承担，作文说将依法追究其法律责任。</p>
    <p>2.4 用户使用作文说各单项服务时，其使用行为视为对服务条款及作文说发出的各类公告的同意。</p>
    <p>2.5 用户应明确了解并同意，作文说会员的付费方式为代收费运营商托收。通过此方式付费可能存在商业风险，如不法分子利用用户账号或银行卡进行违法活动，可能导致经济损失。用户应自行承担追究侵权责任及可能的后果。</p>
    <p>2.6 用户应妥善保管、使用、维护在作文说申请的账号、账号信息及密码。用户应对账号信息和密码采取保密措施。非作文说原因导致的账号密码泄露或保管、使用、维护不当造成的损失，作文说不承担责任。</p>
    <p>2.7 作文说不对因第三方行为或不作为造成的损失承担责任，包括但不限于支付服务、网络接入服务、第三方侵权行为等。</p>
    <div class="sec_title"><strong>三、作文说会员服务开通</strong></div>
    <p>3.1 作文说将在相关页面上明确提示具体开通操作步骤。</p>
    <p>3.2 用户可通过多种渠道成为作文说会员，包括网银支付、手机支付或第三方支付等。在选择特定方式成为会员时，用户须接受相关服务条款和使用方法。作文说声明：未经授权销售作文说会员账号属非法销售，作文说有权追究法律责任。</p>
    <p>3.3 作文说会员服务为数字化商品服务，一经购买成功，不提供退货退款服务。</p>
    <p>3.4 作文说会员账号所有权归作文说所有，用户拥有有限使用权。</p>
    <p>3.5 作文说仅提供网络服务，与服务相关的设备（如电脑、手机等）及费用（如电话费、上网费、手机费）由用户自行承担。</p>
    <div class="sec_title"><strong>四、作文说会员服务生效和账号查询</strong></div>
    <p>4.1 用户成为作文说会员后，即视为认可服务标明的价格；服务即时生效。</p>
    <p>4.2 会员服务的资费标准以作文说APP标注的为准。作文说有权根据业务发展变更资费标准，但会为不同阶段已激活的会员提供续费、升级优惠。具体政策以官方公告为准。</p>
    <p>4.3 用户可登录作文说用户中心免费查询账号信息，包括服务内容、期限、消费金额、交易状态等。</p>
    <div class="sec_title"><strong>五、作文说会员服务权限</strong></div>
    <p>5.1 会员服务提供的视频、练习等付费内容有固定使用期限。用户成为会员即视为认可使用期限。</p>
    <p>5.2 会员在线观看视频的权限：观看周期不因中断、终止、倒回等情况延长。</p>
    <div class="sec_title"><strong>六、作文说会员用户的权利及限制</strong></div>
    <p>6.1 会员有效期内，用户享有作文说提供的各项权益和增值服务。</p>
    <p>6.2 提供的服务内容不得用于商业、盈利目的，仅限于私人观看。</p>
    <p>6.3 服务仅限申请账号的本人使用。禁止转让、赠与、借用、租用或售卖。违反者，作文说有权取消服务资格，损失由用户承担。</p>
    <p>6.4 同一会员账号限在一个设备上使用。超出范围使用，作文说有权封禁账号并追究法律责任。</p>
    <p>6.5 用户行为若违反协议或法律法规，或损害作文说或他人利益，作文说有权取消其会员资格，不补偿。</p>
    <p>6.6 用户不得通过非法途径获取服务，否则作文说有权取消服务资格，问题由用户承担。</p>
    <p>6.7 用户不得使用违法、淫秽、侮辱性的昵称和签名档。违规者，作文说有权取消资格，不补偿。</p>
    <p>6.8 被取消资格的用户，不再享有优惠和服务，不参加活动。</p>
    <p>6.9 未经作文说许可，禁止以下行为：</p>
    <p>6.9.1 非法修改账号服务期限、消费金额、交易状态；非法使用已购内容。</p>
    <p>6.9.2 有偿或无偿提供账号给他人使用非付费内容。</p>
    <p>6.9.3 复制、销售、出租或授权第三方使用内容。</p>
    <p>6.9.4 破解、篡改安全措施，或协助他人这样做。</p>
    <p>6.9.5 通过非认可方式获取内容，或删除所有权声明。</p>
    <p>6.9.6 公开展示内容，除非不侵权。</p>
    <p>6.9.7 损害第三方利益，如侵犯隐私、知识产权、财产权等。</p>
    <div class="sec_title"><strong>七、连续包月服务</strong></div>
    <p>7.1 本协议规定用户使用自动续费服务的权利义务。用户使用即受条款约束。</p>
    <p>7.2 连续包月用户可定期获得会员付费内容等。服务有效期通常为一个月。</p>
    <p>7.3 服务说明：</p>
    <p>7.3.1 用户授权作文说在会员到期时，从绑定的支付账号扣费。服务前提是账号已绑定且可扣款。</p>
    <p>7.3.2 用户保证作文说可成功扣款。余额不足导致续费失败，由用户负责。</p>
    <p>7.3.3 扣费出错时，双方应配合查明原因，按责任程度分担损失。</p>
    <p>7.3.4 服务仅限平台内使用。非法分离服务内容，由行为人承担法律后果。</p>
    <p>7.4 开通支付渠道：</p>
    <p>7.4.1 作文说开通支付宝、银联、电信运营商代收等支付渠道。</p>
    <p>7.4.2 用户应确保支付账号余额充足。不足导致服务暂停，作文说不另行通知。</p>
    <p>7.5 服务有效期：</p>
    <p>7.5.1 服务通常长期有效。</p>
    <p>7.5.2 用户可自主取消服务。不取消视为同意不定期扣款。</p>
    <p>7.5.3 价格调整以现时有效为准。</p>
    <p>7.5.4 用户通过服务支付费用，视同认购相关服务。作文说不补偿。</p>
    <p>7.6 退订服务：</p>
    <p>7.6.1 用户可根据我们的退费政策退订服务。</p>
    <div class="sec_title"><strong>八、服务变更、中止或终止</strong></div>
    <p>8.1 作文说变更服务或协议，用户不同意可取消服务。继续使用视为接受变更。</p>
    <p>8.2 修改的协议内容将在页面公示，公布即通知用户。</p>
    <p>8.3 服务期限包含解决故障、维修、升级等时间。上述时间不补偿。</p>
    <p>8.4 用户使用服务遭受损失，作文说不负责。账号密码泄露，作文说不负责。</p>
    <p>8.5 用户不同意修改，可终止服务。已享受服务的费用不退还。</p>
    <p>8.6 不可抗力导致服务无法继续，作文说不承担损失，不退还费用。</p>
    <p>8.7 用户违规，作文说有权终止服务，取消账号，不退还费用。</p>
    <p>8.8 作文说未行使权利不构成放弃。可随时要求履行义务，承担违约责任。</p>
    <p>8.9 “永久性”、“长期性”、“终身”等描述，使用期限至产品服务停运日。使用范围为购买时对应的内容模块。新增内容模块可收费，标准以公示为准。</p>
  </div>
</template>

<script>
export default {
  setup() {
    return {};
  },
};
</script>

<style lang="scss" scoped>
.vip_agre {
  padding: 24px 20px;
  .vip_title {
    text-align: center;
  }
  .sec_title {
    margin: 16px 0 8px;
  }
  p {
    line-height: 27px;
    color: #333;
    text-align: justify;
    margin-bottom: 4px;
  }
}
</style>